---
kind: other
id: Properties.T:Autodesk.Revit.UI.UIApplication
source: html/6d4bd9e2-ba40-8fb2-431d-8cb20b791626.htm
---
# UIApplication Properties

Get current active external application or external command id.